/*
 * @Author: 萌新王
 * @Date: 2023-09-15 16:49:39
 * @LastEditors: 萌新王
 * @LastEditTime: 2023-09-18 17:22:30
 * @FilePath: \Sokoban\src\config.js
 * @Email: 763103245@qq.com
 */
var Config = {
    Grid: {
        Size: {
            x: 8,
            y: 8,
        }
    },
    /**地图 */
    Level: [
        [
            ["×", "×", "×", "×", "×", "×", "×", "×"],
            ["×", "△", "·", "×", "×", "×", "×", "×"],
            ["×", "·", "·", "·", "·", "□", "·", "×"],
            ["×", "·", "·", "×", "×", "×", "·", "×"],
            ["×", "·", "·", "·", "·", "·", "·", "×"],
            ["×", "×", "Z", "×", "×", "×", "×", "×"],
            ["×", "×", "×", "×", "×", "×", "×", "×"],
            ["×", "×", "×", "×", "×", "×", "×", "×"],
        ]
    ],
    /**节点类型 */
    NodeType: {
        /**障碍 */
        zoc: "x",
        /**玩家 */
        player: "△",
        /**道路 */
        road: "·",
        /**目标点 */
        target: "Z",
        /**箱子 */
        box: "□",
    }
}
for (var i = 0; i < Config.Level.Level; i++) {
    Config.Level[i] = Config.Level[i].reverse()
} 
